CreativeRobotics/ArduinoCore-samd/boards.txt
# Enactive Torch PCE (SAMD51)
# ------------------------------
enactive_torch_pce.name=Enactive Torch PCE (SAMD51)
enactive_torch_pce.vid.0=0x239A
enactive_torch_pce.pid.0=0x8020
enactive_torch_pce.vid.1=0x239A
enactive_torch_pce.pid.1=0x0020
enactive_torch_pce.upload.tool=bossac18
enactive_torch_pce.upload.protocol=sam-ba
enactive_torch_pce.upload.maximum_size=1032192
enactive_torch_pce.upload.offset=0x4000
enactive_torch_pce.upload.use_1200bps_touch=true
enactive_torch_pce.upload.wait_for_upload_port=true
enactive_torch_pce.upload.native_usb=true
enactive_torch_pce.build.mcu=cortex-m4
enactive_torch_pce.build.f_cpu=120000000L
enactive_torch_pce.build.usb_product="Enactive Torch PCE"
enactive_torch_pce.build.usb_manufacturer="Creative Robotics"
enactive_torch_pce.build.board=METRO_M4
enactive_torch_pce.build.core=arduino
enactive_torch_pce.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
enactive_torch_pce.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
enactive_torch_pce.build.openocdscript=openocd_scripts/arduino_zero.cfg
enactive_torch_pce.build.variant=enactive_torch_pce
enactive_torch_pce.build.variant_system_lib=
enactive_torch_pce.build.vid=0x239A
enactive_torch_pce.build.pid=0x8020
enactive_torch_pce.bootloader.tool=openocd
enactive_torch_pce.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
enactive_torch_pce.compiler.arm.cmsis.ldflags="-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
enactive_torch_pce.menu.cache.on=Enabled
enactive_torch_pce.menu.cache.on.build.cache_flags=-DENABLE_CACHE
enactive_torch_pce.menu.cache.off=Disabled
enactive_torch_pce.menu.cache.off.build.cache_flags=


# HabIntroExtro
# ------------------------------
habIntroExtro.name=habIntroExtro
habIntroExtro.vid.0=0x16D0
habIntroExtro.pid.0=0x0557
habIntroExtro.vid.1=0x16D0
habIntroExtro.pid.1=0x0856
habIntroExtro.vid.2=0x16D0
habIntroExtro.pid.2=0x0B41
habIntroExtro.vid.3=0x16D0
habIntroExtro.pid.3=0x0B40
habIntroExtro.vid.4=0x16D0
habIntroExtro.pid.4=0x0A0C
habIntroExtro.vid.5=0x16D0
habIntroExtro.pid.5=0x0856
habIntroExtro.upload.tool=bossac
habIntroExtro.upload.protocol=sam-ba
habIntroExtro.upload.maximum_size=262144
habIntroExtro.upload.offset=0x2000
habIntroExtro.upload.use_1200bps_touch=true
habIntroExtro.upload.wait_for_upload_port=true
habIntroExtro.upload.native_usb=true
habIntroExtro.build.mcu=cortex-m0plus
habIntroExtro.build.f_cpu=48000000L
habIntroExtro.build.usb_product="HabIntroExtro"
habIntroExtro.build.usb_manufacturer="Haberdashery"
habIntroExtro.build.board=SAMD_ZERO
habIntroExtro.build.core=arduino
habIntroExtro.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
habIntroExtro.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
habIntroExtro.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
habIntroExtro.build.variant=habIntroExtro
habIntroExtro.build.variant_system_lib=
habIntroExtro.build.vid=0x16D0
habIntroExtro.build.pid=0x0557
habIntroExtro.bootloader.tool=arduino:openocd
habIntroExtro.bootloader.file=zero/binaries/sam_ba_Generic_x21G_SAMD21G18A.bin
habIntroExtro.menu.usbstack.arduino=Arduino
habIntroExtro.menu.usbstack.tinyusb=TinyUSB
habIntroExtro.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
habIntroExtro.menu.debug.off=Off
habIntroExtro.menu.debug.on=On
habIntroExtro.menu.debug.on.build.flags.debug=-g


# HabIntroExtroPro
# ------------------------------
habIntroExtroPro.name=habIntroExtroPro
habIntroExtroPro.vid.0=0x16D0
habIntroExtroPro.pid.0=0x0557
habIntroExtroPro.vid.1=0x16D0
habIntroExtroPro.pid.1=0x0856
habIntroExtroPro.vid.2=0x16D0
habIntroExtroPro.pid.2=0x0B41
habIntroExtroPro.vid.3=0x16D0
habIntroExtroPro.pid.3=0x0B40
habIntroExtroPro.vid.4=0x16D0
habIntroExtroPro.pid.4=0x0A0C
habIntroExtroPro.vid.5=0x16D0
habIntroExtroPro.pid.5=0x0856
habIntroExtroPro.upload.tool=bossac
habIntroExtroPro.upload.protocol=sam-ba
habIntroExtroPro.upload.maximum_size=131072
habIntroExtroPro.upload.offset=0x2000
habIntroExtroPro.upload.use_1200bps_touch=true
habIntroExtroPro.upload.wait_for_upload_port=true
habIntroExtroPro.upload.native_usb=true
habIntroExtroPro.build.mcu=cortex-m0plus
habIntroExtroPro.build.f_cpu=48000000L
habIntroExtroPro.build.usb_product="HabIntroExtroPro"
habIntroExtroPro.build.usb_manufacturer="Haberdashery"
habIntroExtroPro.build.board=SAMD_ZERO
habIntroExtroPro.build.core=arduino
habIntroExtroPro.build.extra_flags=-DCRYSTALLESS -D__SAMD21G17A__ -DARM_MATH_CM0PLUS {build.usb_flags}
habIntroExtroPro.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
habIntroExtroPro.build.openocdscript=openocd_scripts/SAMD21G17A.cfg
habIntroExtroPro.build.variant=habIntroExtroPro
habIntroExtroPro.build.variant_system_lib=
habIntroExtroPro.build.vid=0x16D0
habIntroExtroPro.build.pid=0x0557
habIntroExtroPro.bootloader.tool=arduino:openocd
habIntroExtroPro.bootloader.file=zero/binaries/sam_ba_Generic_x21G_SAMD21G17A.bin
habIntroExtroPro.menu.usbstack.arduino=Arduino
habIntroExtroPro.menu.usbstack.tinyusb=TinyUSB
habIntroExtroPro.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
habIntroExtroPro.menu.debug.off=Off
habIntroExtroPro.menu.debug.on=On
habIntroExtroPro.menu.debug.on.build.flags.debug=-g


# BaseXD51 64 (SAMD51)
# ------------------------------
BASEXD51_64.name=BaseXD51 64 (SAMD51)
BASEXD51_64.vid.0=0x239A
BASEXD51_64.pid.0=0x8020
BASEXD51_64.vid.1=0x239A
BASEXD51_64.pid.1=0x0020
BASEXD51_64.upload.tool=bossac18
BASEXD51_64.upload.protocol=sam-ba
BASEXD51_64.upload.maximum_size=1032192
BASEXD51_64.upload.offset=0x4000
BASEXD51_64.upload.use_1200bps_touch=true
BASEXD51_64.upload.wait_for_upload_port=true
BASEXD51_64.upload.native_usb=true
BASEXD51_64.build.mcu=cortex-m4
BASEXD51_64.build.f_cpu=120000000L
BASEXD51_64.build.usb_product="Adafruit Metro M4"
BASEXD51_64.build.usb_manufacturer="Adafruit LLC"
BASEXD51_64.build.board=METRO_M4
BASEXD51_64.build.core=arduino
BASEXD51_64.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_METRO_M4_EXPRESS -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
BASEXD51_64.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
BASEXD51_64.build.openocdscript=openocd_scripts/arduino_zero.cfg
BASEXD51_64.build.variant=baseXD51_64
BASEXD51_64.build.variant_system_lib=
BASEXD51_64.build.vid=0x239A
BASEXD51_64.build.pid=0x8020
BASEXD51_64.bootloader.tool=openocd
BASEXD51_64.bootloader.file=metroM4/bootloader-metro_m4-v2.0.0-adafruit.5.bin
BASEXD51_64.compiler.arm.cmsis.ldflags="-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16
BASEXD51_64.menu.cache.on=Enabled
BASEXD51_64.menu.cache.on.build.cache_flags=-DENABLE_CACHE
BASEXD51_64.menu.cache.off=Disabled
BASEXD51_64.menu.cache.off.build.cache_flags=



