CreativeRobotics/ArduinoCore-samd/boards.txt
# BaseXD21 48 (SAMD21)
# ------------------------------
BASEXD21_48.name=BaseXD21 48 (SAMD21)
BASEXD21_48.vid.0=0x16D0
BASEXD21_48.pid.0=0x0557
BASEXD21_48.vid.1=0x16D0
BASEXD21_48.pid.1=0x0856
BASEXD21_48.vid.2=0x16D0
BASEXD21_48.pid.2=0x0B41
BASEXD21_48.vid.3=0x16D0
BASEXD21_48.pid.3=0x0B40
BASEXD21_48.vid.4=0x16D0
BASEXD21_48.pid.4=0x0A0C
BASEXD21_48.vid.5=0x16D0
BASEXD21_48.pid.5=0x0856
BASEXD21_48.upload.tool=bossac
BASEXD21_48.upload.protocol=sam-ba
BASEXD21_48.upload.maximum_size=262144
BASEXD21_48.upload.offset=0x2000
BASEXD21_48.upload.use_1200bps_touch=true
BASEXD21_48.upload.wait_for_upload_port=true
BASEXD21_48.upload.native_usb=true
BASEXD21_48.build.mcu=cortex-m0plus
BASEXD21_48.build.f_cpu=48000000L
BASEXD21_48.build.usb_product="BaseXD21_48"
BASEXD21_48.build.usb_manufacturer="Creative Robotics"
BASEXD21_48.build.board=SAMD_ZERO
BASEXD21_48.build.core=arduino
BASEXD21_48.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -D__SAMD21G18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
BASEXD21_48.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
BASEXD21_48.build.openocdscript=openocd_scripts/itsybitsy_m0.cfg
BASEXD21_48.build.variant=baseXD21_48
BASEXD21_48.build.variant_system_lib=
BASEXD21_48.build.vid=0x16D0
BASEXD21_48.build.pid=0x0557
BASEXD21_48.bootloader.tool=arduino:openocd
BASEXD21_48.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin
BASEXD21_48.menu.usbstack.arduino=Arduino
BASEXD21_48.menu.usbstack.tinyusb=TinyUSB
BASEXD21_48.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
BASEXD21_48.menu.debug.off=Off
BASEXD21_48.menu.debug.on=On
BASEXD21_48.menu.debug.on.build.flags.debug=-g


# BaseXD21 48XL (SAMD21)
# ------------------------------
BASEXD21_48XL.name=BaseXD21 48XL (SAMD21)
BASEXD21_48XL.vid.0=0x239A
BASEXD21_48XL.pid.0=0x800F
BASEXD21_48XL.vid.1=0x239A
BASEXD21_48XL.pid.1=0x000F
BASEXD21_48XL.vid.2=0x239A
BASEXD21_48XL.pid.2=0x8012
BASEXD21_48XL.upload.tool=bossac
BASEXD21_48XL.upload.protocol=sam-ba
BASEXD21_48XL.upload.maximum_size=262144
BASEXD21_48XL.upload.offset=0x2000
BASEXD21_48XL.upload.use_1200bps_touch=true
BASEXD21_48XL.upload.wait_for_upload_port=true
BASEXD21_48XL.upload.native_usb=true
BASEXD21_48XL.build.mcu=cortex-m0plus
BASEXD21_48XL.build.f_cpu=48000000L
BASEXD21_48XL.build.usb_product="BaseXD21_48XL"
BASEXD21_48XL.build.usb_manufacturer="Creative Robotics"
BASEXD21_48XL.build.board=ITSYBITSY_M0
BASEXD21_48XL.build.core=arduino
BASEXD21_48XL.build.extra_flags=-DCRYSTALLESS -DADAFRUIT_ITSYBITSY_M0 -D__SAMD21J18A__ -DARM_MATH_CM0PLUS {build.usb_flags}
BASEXD21_48XL.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
BASEXD21_48XL.build.openocdscript=openocd_scripts/itsybitsy_m0.cfg
BASEXD21_48XL.build.variant=baseXD21_48XL
BASEXD21_48XL.build.variant_system_lib=
BASEXD21_48XL.build.vid=0x239A
BASEXD21_48XL.build.pid=0x800F
BASEXD21_48XL.bootloader.tool=openocd
BASEXD21_48XL.bootloader.file=itsybitsyM0/bootloader-itsybitsy_m0-v2.0.0-adafruit.5.bin
BASEXD21_48XL.menu.usbstack.arduino=Arduino
BASEXD21_48XL.menu.usbstack.tinyusb=TinyUSB
BASEXD21_48XL.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
BASEXD21_48XL.menu.debug.off=Off
BASEXD21_48XL.menu.debug.on=On
BASEXD21_48XL.menu.debug.on.build.flags.debug=-g


